Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр Выручка
	Движения.Выручка.Записывать = Истина;
	Для Каждого ТекСтрокаСоставЗаказа из СоставЗаказа Цикл
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.ПозицияМеню = ТекСтрокаСоставЗаказа.ПозицияМеню;
		Движение.Сумма = ТекСтрокаСоставЗаказа.ИтогоПоПозицииМеню;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиент") Тогда
		// Заполнение шапки
		Итого = ДанныеЗаполнения.Итого;

		Для Каждого ТекСтрокаСоставЗаказа из ДанныеЗаполнения.СоставЗаказа Цикл
			НоваяСтрока = СоставЗаказа.Добавить();
			НоваяСтрока.ПозицияМеню = ТекСтрокаСоставЗаказа.СтатьяЗаказа;
			НоваяСтрока.Цена = ТекСтрокаСоставЗаказа.Цена;
			НоваяСтрока.Количество = ТекСтрокаСоставЗаказа.Количество;
			НоваяСтрока.ИтогоПоПозицииМеню = ТекСтрокаСоставЗаказа.ИтогоПоПозицииМеню
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
