Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр Выручка
	Движения.Выручка.Записывать = Истина;
	Для Каждого ТекСтрокаСоставЗаказа из СоставЗаказа Цикл
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.ПозицияМеню = ТекСтрокаСоставЗаказа.ПозицияМеню;
		Движение.Сумма = ТекСтрокаСоставЗаказа.ИтогоПоПозицииМеню;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заказ") Тогда
		
		Для Каждого ТекСтрокаСоставЗаказа из ДанныеЗаполнения.СоставЗаказа Цикл
			НоваяСтрока = СоставЗаказа.Добавить();
			НоваяСтрока.ПозицияМеню = ТекСтрокаСоставЗаказа.СтатьяЗаказа;
			НоваяСтрока.Количество = ТекСтрокаСоставЗаказа.Количество;
			НоваяСтрока.Цена = ТекСтрокаСоставЗаказа.СтатьяЗаказа.ЦенаТовара;
			НоваяСтрока.ИтогоПоПозицииМеню = НоваяСтрока.Цена * НоваяСтрока.Количество;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
