
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
// Вставить содержимое обработчика.
Объект.НДС = 0;
Для каждого СтрокаДокумента Из Объект.СоставЗаказа Цикл
Объект.НДС = Объект.НДС + (СтрокаДокумента.Количество * СтрокаДокумента.Цена * 20 / 120);
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НаличныеПриИзменении(Элемент)
Объект.Сдача = Объект.Наличные - Объект.Итого;
КонецПроцедуры

&НаКлиенте
Процедура СпособОплатыПриИзменении(Элемент)
	Если Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Наличными") Тогда
		Элементы.ОплатаНаличные.Доступность = Истина;
	Иначе
		Элементы.ОплатаНаличные.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры




