
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Объект.НДС = 0;
Объект.НДС = Объект.Итого *20 /120
КонецПроцедуры

&НаКлиенте
Процедура НаличныеПриИзменении(Элемент)
Объект.Сдача = Объект.Наличные - Объект.Итого;
КонецПроцедуры

&НаСервере
Функция ПолучениеРазмераСкидки(Скидка);
	Возврат Скидка.РазмерСкидки;
КонецФункции
	
&НаКлиенте
Процедура ПримененныеАкцииПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПримененныеАкции) Тогда
		Объект.Итого = Объект.Итого * (1 - ПолучениеРазмераСкидки(Объект.ПримененныеАкции) / 100);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СпособОплатыПриИзменении(Элемент)
	Если Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Наличными") Тогда
		Элементы.ОплатаНаличные.Доступность = Истина;
	Иначе
		Элементы.ОплатаНаличные.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры




