&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

Объект.Итого = 0;
Для каждого СтрокаДокумента Из Объект.СоставЗаказа Цикл
Объект.Итого = Объект.Итого + (СтрокаДокумента.Количество * СтрокаДокумента.Цена);
КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СоставЗаказаНаименованиеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставЗаказа.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.СтатьяЗаказа) Тогда
		ТекущиеДанные.Цена = ТекущиеДанные.СтатьяЗаказа.ЦенаТовара;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	СтрокаТабличнойЧасти.ИтогоПоПозицииМеню = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
КонецПроцедуры
